package oop0309;

public class Test04_bit {
	
	public static void main(String[] args) {
		System.out.println(5&3);//비트곱
		System.out.println(5|3);//비트합
		
		//5->(2진수로)101, 3->11
		
		/*
		 128 64 32 16 8 4 2 1
		 10진수를 2진수로 빠르게 바꾸기
	     10-> 8과 16의 사이. 시작점 잡고 간다
		              1 0 1 0
		 77-> 1  0  0 1 1 0 0
		 시작점 잡고 -> 남은수 뺴고 -> 다시 시작점잡고. 
		
		      
		  5-> 	00000101 	  00000101
		  3-> &	00000011 	| 00000011
		       ----------    -----------
		     	00000001	  00000111	
		     	0*1은 0 		하나만참이어도참(1)
		     	1*1은 1
		     	둘다참이어야참(1)
		     	=1			  =7
		 */
	}

}
